In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Accounts (account_id int, income int)

In [ ]:
insert into Accounts (account_id, income) values ('3', '108939')

In [ ]:
insert into Accounts (account_id, income) values ('2', '12747')

In [ ]:
insert into Accounts (account_id, income) values ('8', '87709')

In [ ]:
insert into Accounts (account_id, income) values ('6', '91796')

In [ ]:
select * from accounts

+------------+--------+
| account_id | income |
+------------+--------+
| 3          | 108939 |
+------------+--------+
| 2          | 12747  |
+------------+--------+
| 8          | 87709  |
+------------+--------+
| 6          | 91796  |
+------------+--------+

## Write a solution to calculate the number of bank accounts for each salary category.

In [ ]:
select (case
    when income<20000 then 'low' 
    when income>50000 then 'high' 
    else 'med' end) category
from accounts

+----------+
| category |
+----------+
| high     |
+----------+
| low      |
+----------+
| high     |
+----------+
| high     |
+----------+

In [ ]:
select count(*), (case
    when income<20000 then 'low' 
    when income>50000 then 'high' 
    else 'med' end) category
from accounts
group by category

+----------+----------+
| count(*) | category |
+----------+----------+
| 3        | high     |
+----------+----------+
| 1        | low      |
+----------+----------+

## Union

In [ ]:
select 'low' category, sum(case when income<20000 then 1 else 0 end) cnt
from accounts 
union 
select 'med', sum(case when income<=50000 and income>=20000 then 1 else 0 end)
from accounts 
union
select 'high', sum(case when income>50000 then 1 else 0 end)
from accounts

+----------+-----+
| category | cnt |
+----------+-----+
| high     | 3   |
+----------+-----+
| low      | 1   |
+----------+-----+
| med      | 0   |
+----------+-----+

## another idea: "create" intermediate table

In [ ]:
with cat_list(category) as (select 'high' union select 'med' union select 'low'),
t as (select count(*) cnt, (case
    when income<20000 then 'low' 
    when income>50000 then 'high' 
    else 'med' end) category
from accounts
group by category)

select ifnull(cnt,0), category from t right join cat_list using (category)

+---------------+----------+
| ifnull(cnt,0) | category |
+---------------+----------+
| 3             | high     |
+---------------+----------+
| 1             | low      |
+---------------+----------+
| 0             | med      |
+---------------+----------+